---
kind: type
id: T:Autodesk.Revit.DB.Structure.PointLoad
source: html/3f703eb6-7eac-c80e-e693-ebcdd6b35bbe.htm
---
# Autodesk.Revit.DB.Structure.PointLoad

An object that represents a force/moment applied to a single point.
 Data members

## Syntax (C#)
```csharp
public class PointLoad : LoadBase
```